cf/DataProcessors/КонтактнаяИнформация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>КонтактнаяИнформация</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Грузополучатели</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
						<v8:Type>cfg:CatalogRef.ТочкиПродаж</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

cf/ChartsOfCharacteristicTypes/СоставКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<ChartOfCharacteristicTypes>
		<Properties>
			<Name>СоставКонтактнойИнформации</Name>
			<Type>
				<v8:Type>cfg:CatalogRef.Города</v8:Type>
				<v8:Type>cfg:CatalogRef.ЗначенияХарактерстикКонтактнойИнформации</v8:Type>
				<v8:Type>xs:string</v8:Type>
				<v8:Type>xs:dateTime</v8:Type>
				<v8:Type>xs:decimal</v8:Type>
				<v8:Type>cfg:CatalogRef.Регионы</v8:Type>
				<v8:Type>cfg:CatalogRef.Страны</v8:Type>
				<v8:Type>cfg:CatalogRef.Улицы</v8:Type>
				<v8:NumberQualifiers>
					<v8:Digits>20</v8:Digits>
					<v8:FractionDigits>0</v8:FractionDigits>
				</v8:NumberQualifiers>
				<v8:StringQualifiers>
					<v8:Length>100</v8:Length>
				</v8:StringQualifiers>
				<v8:DateQualifiers>
					<v8:DateFractions>Date</v8:DateFractions>
				</v8:DateQualifiers>
			</Type>
			<Hierarchical>false</Hierarchical>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сокращение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Владелец</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СоставКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обязательный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОграничениеПоСтрокам</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Строка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</ChartOfCharacteristicTypes>
</MetaDataObject>

cf/DataProcessors/КонтактнаяИнформация/Ext/ManagerModule.bsl
&НаСервере
Функция	СформироватьПредставление(Группа, ЗначенияПолей, ЕстьСокращение) Экспорт
	
	Если Группа = Справочники.ВидыКонтактнойИнформации.Телефон Тогда
		
		Если ТипЗнч(ЗначенияПолей) = Тип("Соответствие") Тогда
			Возврат СформироватьПредставлениеТелефонИзСоответствия(ЗначенияПолей);
		Иначе
			Возврат СформироватьПредставлениеТелефон(ЗначенияПолей);
		КонецЕсли;
	КонецЕсли;
	
	Возврат УправлениеКонтактнойИнформацией.ПолучитьСтроковоеПредставлениеАдреса(ЗначенияПолей, "Ключ", ЕстьСокращение);
	
КонецФункции

&НаСервере
Функция ЗначениеПоПолю(Поле, ЗначенияПолей)
	
	Строки = ЗначенияПолей.НайтиСтроки(Новый Структура("Поле", ПланыВидовХарактеристик.СоставКонтактнойИнформации[Поле]));
	
	Если Строки.Количество() Тогда
		ЗначениеПоля = Формат(Строки[0].Значение,"ЧГ=");
		Возврат ?(ПустаяСтрока(ЗначениеПоля), "", Строки[0].Сокращение +ЗначениеПоля);
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

&НаСервере
Функция	СформироватьПредставлениеТелефон(ЗначенияПолей)
	
	НовоеПредставление = "";
	
	КодСтраны	= ЗначениеПоПолю("КодСтраны", ЗначенияПолей);
	КодГорода 	= ЗначениеПоПолю("КодГорода", ЗначенияПолей);
	Добавочный	= ЗначениеПоПолю("Внутренний", ЗначенияПолей);
	
	НовоеПредставление = ПредставлениеТелефон(КодСтраны, КодГорода, ЗначениеПоПолю("НомерТелефона", ЗначенияПолей), Добавочный); 	
		
	Возврат СокрЛП(НовоеПредставление);
	
КонецФункции

Функция ПредставлениеТелефон(КодСтраны, КодГорода, Номер, Добавочный)
	Если стрДлина(Номер) = 6 Тогда
		Номер = Лев(Номер,2)+"-"+Сред(Номер,3,2)+"-"+Прав(Номер,2);
	ИначеЕсли стрДлина(Номер) = 7 Тогда
		Номер = Лев(Номер,3)+"-"+Сред(Номер,4,2)+"-"+Прав(Номер,2);
	КонецЕсли;
	
	Возврат ?(ПустаяСтрока(КодСтраны), "", "+" + КодСтраны)+ ?(ПустаяСтрока(КодГорода), "", " (" + КодГорода + ") ") + Номер + ?(ПустаяСтрока(Добавочный), "", "," + Добавочный);
	
КонецФункции


&НаСервере
Функция	СформироватьПредставлениеТелефонИзСоответствия(ЗначенияПолей)
	
	НовоеПредставление = "";
	
	КодСтраны	= ЗначенияПолей.Получить(ПланыВидовХарактеристик.СоставКонтактнойИнформации["КодСтраны"]);
	КодГорода 	= ЗначенияПолей.Получить(ПланыВидовХарактеристик.СоставКонтактнойИнформации["КодГорода"]);
	Добавочный	= ЗначенияПолей.Получить(ПланыВидовХарактеристик.СоставКонтактнойИнформации["Внутренний"]);
	НомерТелефона = ЗначенияПолей.Получить(ПланыВидовХарактеристик.СоставКонтактнойИнформации["НомерТелефона"]);
	
	НовоеПредставление = ПредставлениеТелефон(КодСтраны, КодГорода, НомерТелефона, Добавочный); 	
		
	Возврат СокрЛП(НовоеПредставление);
	
КонецФункции
